public_html/ADRC/02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-16 sab 20:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ADRC - Lesson 02</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Alessandro Straziota Alessandro Straziota" />
<link rel="stylesheet" href="/appunti.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">ADRC - Lesson 02</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfb6d73b">1. Ambiente distribuito</a>
<ul>
<li><a href="#org2e5c97a">1.1. Entità</a>
<ul>
<li><a href="#org2a28e8a">1.1.1. Stato di una entità</a></li>
</ul>
</li>
<li><a href="#orga19d458">1.2. Eventi</a></li>
<li><a href="#org7b20fe5">1.3. Azioni</a></li>
<li><a href="#org808c605">1.4. Comportamento delle entità</a></li>
<li><a href="#orgd4e68aa">1.5. Comportamento del sistema - protocollo</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<b>Nota:</b> parto direttamente dagli appunti della seconda lezione di <i>Algoritmi Distribuiti e Reti Complesse</i>
in quanto la prima consisteva solamente in alcuni esempi che introducevano agli argomenti del corso.
Probabilmente in futuro verrà fatta la pagina con gli esempi della prima lezione.
</p>

<div id="outline-container-orgfb6d73b" class="outline-2">
<h2 id="orgfb6d73b"><span class="section-number-2">1</span> Ambiente distribuito</h2>
<div class="outline-text-2" id="text-1">
<p>
Prima di procedere allo studio di algoritmi distribuiti è necessario definire in maniera rigorosa (e non ambigua)
un <i>modello di calcolo</i>.
Tale definizione di modello sarà utile non solo per definire algoritmi distribuiti, ma anche per fare un'analisi
della loro <i>correttezza</i> e <i>stabilità</i>.<br />
</p>

<p>
In maniera informale possiamo definire un <b>ambiente distribuito</b> (il nostro modello di calcolo) come un <b>insieme di agenti</b>,
aventi ognuno delle <b>capacità computazionali</b>, e che interagiscono tra di loro scambiandosi messaggi (<i>message passing</i>)
tramite una serie di <b>interconnesioni</b>.
</p>

<p>
Ovviamente, tale definizione di ambiente distribuito sarà modellata rigorosamente tramite la struttura matematica del <b>grafo</b>.
</p>

<p>
[IMAGINE GRAFO]
</p>
</div>

<div id="outline-container-org2e5c97a" class="outline-3">
<h3 id="org2e5c97a"><span class="section-number-3">1.1</span> Entità</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Come già detto, ogni <b>entità</b> (o <b>nodo</b>) della rete ha delle capacità computazionali, le quali sono definite come
un insieme di <b>operazioni possibili</b>, quali:
</p>
<ul class="org-ul">
<li><b>local storage e processing</b> ovvero la capacità di conservare informazioni di processarle in maniera <b>locale</b></li>
<li><b>scambio di messaggi</b> con altri nodi della rete</li>
<li><b>(re-)impostare il clock</b>. Ogni nodo ha un <b>clock</b> interno che standisce come eseguire le sue azioni, il quale può essere impostato</li>
<li><b>cambiare il valore dei regitstri</b>. Ogni nodo ha dei <b>registri</b> usati per eseguire le operazioni e/o mantere uno <b>stato</b><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></li>
</ul>
</div>

<div id="outline-container-org2a28e8a" class="outline-4">
<h4 id="org2a28e8a"><span class="section-number-4">1.1.1</span> Stato di una entità</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Come detto, una entità può avere uno <b>stato</b> interno, il quale rappresenta un'informazione necessaria per il corretto funzionamento 
di un <i>protocollo</i><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> distribuito.<br />
Più formalmente ogni nodo ha un <b>insieme finito</b> di stati possibili \(\Sigma\) <span class="underline"><b>defnito a priori</b></span> (per esempio {idle, computing, waiting, processing, &#x2026;}),
e in ogni istante una un entità è in uno dei suoi possibili stati (il quale dovrà essere <b>sempre definito</b>).<br />
</p>
</div>
</div>
</div>


<div id="outline-container-orga19d458" class="outline-3">
<h3 id="orga19d458"><span class="section-number-3">1.2</span> Eventi</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Il <i>comportamento</i> di ogni entità é <b>reattivo</b>, ovvero scaneta in seguito all'avvenire di <b>eventi</b>
Alcuni esempi di eventi possono essere:
</p>
<ul class="org-ul">
<li>il <i>tick</i> del clock (<i>evento interno al nodo</i>)</li>
<li>la ricezioni di un messaggio (<i>evento esterno al nodo</i>)</li>
<li>un <i>impulso</i> esterno alla rete</li>
</ul>
<p>
Anche se in un contesto reale gli eventi avvengono su una <i>linea temporale discreta</i><sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>,
essi verranno considerati essere avvenuti in maniera <b>sequenziale</b> (o ordinata).
Questo perché in un intervallo di tempo continuo, la probabilità che due eventi indipendenti
occorrano nello stesso identico istante è pari a 0.
</p>
</div>
</div>


<div id="outline-container-org7b20fe5" class="outline-3">
<h3 id="org7b20fe5"><span class="section-number-3">1.3</span> Azioni</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Come accennato, un'entità reagisce in seguito a un evento.
In realtà l'azione che compie in risposta a un evento dipende anche dal suo stato interno nel momento dello stimolo.
\[
   \mbox{State } \times \mbox{ Evento} \mapsto \mbox{ Action}
   \]
In realtà per <i>azione</i> si intende una <i>sequenza di task</i> (o attività) da svolgere (non necessariamente una sola)
come per esempio
</p>
<ul class="org-ul">
<li>computare un algoritmo</li>
<li>mangare un messaggio</li>
<li>cambiare stato</li>
</ul>
<p>
Un'azione è considerata essere <b>atomica</b>, ovvero una volta avviata non può essere interrotta in alcuna maniera.
Inoltre è importante specificare che nel nostro modello le azioni <b>terminano sempre in un tempo finito</b>.<br />
</p>
</div>
</div>


<div id="outline-container-org808c605" class="outline-3">
<h3 id="org808c605"><span class="section-number-3">1.4</span> Comportamento delle entità</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Come detto in precedenza, per ogni coppia di stato ed evento corrisponde un'azione.
Questa associazione è dette <b>regola</b>.<br />
</p>

<p>
Più in generale possiamo definire un <b>comportamento</b> di un'entità come un insieme di regole.
Quindi, dato un'entità \(x\), sia \(\Sigma\) il suo insieme di stati possibili, \(\mathcal{E}\)
l'insieme degli eventi ed \(A\) l'insieme delle azioni che può eseguire.
Il suo comportamento \(B(x)\) è la <i>funzione</i>
\[
   B(x) : \Sigma \times \mathcal{E} \mapsto A
   \]
tale che è <b>deterministica</b> e <b>completa</b>
\[
   \forall (s,e) \in \Sigma \times \mathcal{E} \;\; \exists ! a \in A
   \]
</p>
</div>
</div>


<div id="outline-container-orgd4e68aa" class="outline-3">
<h3 id="orgd4e68aa"><span class="section-number-3">1.5</span> Comportamento del sistema - protocollo</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Raggruppando tutti i comportamenti delle entita di un sistema è possibile definire
il cosidetto <i>protocollo</i> (o <i>algoritmo</i>) <i>distribuito</i>.<br />
Più formalmente un protocollo è l'insieme
\[
   B := \lbrace B(x) : x \mbox{ è un'entità del sistema}  \rbrace
   \]
Un sistema si dice <b>simmetrico</b> (o <b>omogeneo</b>) se ogni entità ha uno stesso comportamento
\[
   \forall x,y \mbox { entità} \left[ B(x) \equiv B(y) \right]
   \]
In realtà è possibile trasformare ogni sistema in un sistema simmetrico.<br />
Consideriamo un sistema dove esistono due tipi di entità, entità <i>server</i> ed entità <i>client</i>.
Per ogni entità definiamo un <b>ruolo</b>, e in base ad esso eseguiamo l'azione corrispondete.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Esempio in <code>python</code> di come poter rendere un sistema simmetrico</label><pre class="src src-python">class Entity:
    def __init__(self, role):
	self.role = role

    def action(self, state, event):
	if self.role == 'server':
	    server_action(self, state, event)
	else:
	    client_action(self, state, event)
</pre>
</div>


<p>
[&#x2026; da completare]
</p>


<hr>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
generalmente viene usato un <b>registro di stato</b> apposito
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
gli algoritmi distribuiti sono anche detti protocolli
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
io direi <b>approssimativamente discreta</b>, in quanto (a parer mio) non c'è certezza dell'esistenza del continuo
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2021-10-11 lun 00:00</p>
<p class="author">Author: Alessandro Straziota Alessandro Straziota</p>
<p class="date">Created: 2021-10-16 sab 20:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
